const JUZ_NAMES_AR_VOWELLED = [
  '',
  'الْجُزْءُ الْأَوَّل',
  'الْجُزْءُ الثَّانِي',
  'الْجُزْءُ الثَّالِث',
  'الْجُزْءُ الرَّابِع',
  'الْجُزْءُ الْخَامِس',
  'الْجُزْءُ السَّادِس',
  'الْجُزْءُ السَّابِع',
  'الْجُزْءُ الثَّامِن',
  'الْجُزْءُ التَّاسِع',
  'الْجُزْءُ الْعَاشِر',
  'الْجُزْءُ الْحَادِي عَشَر',
  'الْجُزْءُ الثَّانِي عَشَر',
  'الْجُزْءُ الثَّالِث عَشَر',
  'الْجُزْءُ الرَّابِع عَشَر',
  'الْجُزْءُ الْخَامِس عَشَر',
  'الْجُزْءُ السَّادِس عَشَر',
  'الْجُزْءُ السَّابِع عَشَر',
  'الْجُزْءُ الثَّامِن عَشَر',
  'الْجُزْءُ التَّاسِع عَشَر',
  'الْجُزْءُ الْعِشْرُون',
  'الْجُزْءُ الْحَادِي وَالْعِشْرُون',
  'الْجُزْءُ الثَّانِي وَالْعِشْرُون',
  'الْجُزْءُ الثَّالِث وَالْعِشْرُون',
  'الْجُزْءُ الرَّابِع وَالْعِشْرُون',
  'الْجُزْءُ الْخَامِس وَالْعِشْرُون',
  'الْجُزْءُ السَّادِس وَالْعِشْرُون',
  'الْجُزْءُ السَّابِع وَالْعِشْرُون',
  'الْجُزْءُ الثَّامِن وَالْعِشْرُون',
  'الْجُزْءُ التَّاسِع وَالْعِشْرُون',
  'الْجُزْءُ الثَّلَاثُون',
] as const

export function getJuzNameArabicVowelled(juzNumber: number) {
  return JUZ_NAMES_AR_VOWELLED[juzNumber]
    ?? `الْجُزْءُ ${juzNumber}`
}
